{
  "DashLights":
  [
    {"lightName":"Check Engine Light","lightDescription":"General Definition: Detects various issues within the engine, exhaust, or fuel system.\n\nCommon Causes: Faulty oxygen sensor, loose gas cap, catalytic converter issues, or engine misfires.\n\nSuggested Actions: If steady, schedule a diagnostic soon. If flashing, it’s urgent; pull over and have your car checked immediately.","lightSeverity":"High","lightSite":"https://en.wikipedia.org/wiki/Check_engine_light","lightImage":""},
    {"lightName":"Oil Pressure Warning Light","lightDescription":"General Definition: Low oil pressure could mean insufficient oil, which can damage the engine.\n\nCommon Causes: Low oil level, oil pump failure, or oil filter blockage.\n\nSuggested Actions: Stop immediately, check oil levels, and add oil if needed. If the light remains on, seek professional help.","lightSeverity":"High","lightSite":"https://en.wikipedia.org/wiki/Oil_pressure","lightImage":""},
    {"lightName":"Battery Warning Light","lightDescription":"General Definition: Indicates a fault in the charging system, which may cause battery drain and engine shutdown.\n\nCommon Causes: Dead or dying battery, faulty alternator, or corroded battery terminals.\n\nSuggested Actions: Turn off non-essential electronics and get the car checked soon. If the light stays on, the battery may die, so seek help promptly.","lightSeverity":"High","lightSite":"https://en.wikipedia.org/wiki/Battery_indicator","lightImage":""},
    {"lightName":"Brake System Warning Light","lightDescription":"General Definition: Signals low brake fluid, engaged parking brake, or a brake system malfunction.\n\nCommon Causes: Low brake fluid, worn brake pads, or a malfunctioning braking system.\n\nSuggested Actions: Stop immediately and check the parking brake. If the issue persists, do not drive further; arrange for towing or repair.","lightSeverity":"High","lightSite":"https://www.lesschwab.com/article/brakes/what-dashboard-brake-lights-mean.html","lightImage":""},
    {"lightName":"Tire Pressure Warning Light","lightDescription":"General Definition: Indicates incorrect tire pressure in one or more tires.\n\nCommon Causes: Underinflated or overinflated tires, tire puncture, or faulty TPMS sensor.\n\nSuggested Actions: Check and adjust tire pressure. Driving on under- or over-inflated tires can reduce safety and cause uneven wear.","lightSeverity":"Medium","lightSite":"https://en.wikipedia.org/wiki/Tire-pressure_monitoring_system","lightImage":""},
    {"lightName":"Coolant Temperature Warning Light","lightDescription":"General Definition: Shows that the engine is overheating, which can lead to severe damage.\n\nCommon Causes: Low coolant level, faulty radiator, water pump issue, or a thermostat problem.\n\nSuggested Actions: Pull over, turn off the engine, and let it cool. Check coolant levels when cool and top off if needed; seek a mechanic if the light remains on.","lightSeverity":"High","lightSite":"https://www.carparts.com/blog/coolant-temperature-warning-light-meaning-causes-what-to-do/?srsltid=AfmBOoqWymzQFr4NSCH7-WJ-BArXNd3rhRxg_8VgYxGnI8NIMCbsWWZp","lightImage":""},
    {"lightName":"Anti-lock Braking System (ABS) Light","lightDescription":"General Definition: Indicates a problem with the ABS, which prevents wheels from locking during braking.\n\nCommon Causes: Faulty ABS sensor, damaged wiring, or low brake fluid.\n\nSuggested Actions: Normal brakes still work, but ABS may not function on slippery roads. Drive cautiously and have it checked.","lightSeverity":"Medium","lightSite":"https://en.wikipedia.org/wiki/Anti-lock_braking_system","lightImage":""},
    {"lightName":"Airbag Warning Light","lightDescription":"General Definition: Indicates an issue with one or more airbags, possibly affecting deployment.\n\nCommon Causes: Faulty airbag sensor, wiring issue, or a problem in the airbag module.\n\nSuggested Actions: Have it checked immediately. Airbags are critical for safety in the event of an accident.","lightSeverity":"High","lightSite":"https://www.capitalone.com/cars/learn/finding-the-right-car/what-you-need-to-know-about-airbag-warning-lights/2254","lightImage":""},
    {"lightName":"Traction Control Warning Light","lightDescription":"General Definition: Indicates traction control is active or an issue with the system.\n\nCommon Causes: Slippery road conditions, sensor malfunction, or broken wiring.\n\nSuggested Actions: If traction control is on, drive cautiously. If it signals an error, get it checked to ensure handling support in difficult conditions.","lightSeverity":"Low","lightSite":"https://blog.rainbowmuffler.net/blog/the-traction-control-light-what-does-it-mean","lightImage":""},
    {"lightName":"Stability Control Warning Light","lightDescription":"General Definition: Alerts to an issue with the stability control system, which helps in maintaining vehicle control.\n\nCommon Causes: Faulty stability control sensor, broken wiring, or module issue.\n\nSuggested Actions: Drive carefully, especially in turns and slippery areas. Get the system checked.","lightSeverity":"Medium","lightSite":"https://www.kbb.com/car-advice/electronic-stability-control/","lightImage":""},
    {"lightName":"Windshield Washer Light","lightDescription":"General Definition: Indicates that the windshield washer fluid reservoir is low.\n\nCommon Causes: Low or empty washer fluid reservoir.\n\nSuggested Actions: Refill the reservoir with windshield washer fluid at your earliest convenience. This fluid is essential for keeping your windshield clear, especially in bad weather or dusty conditions.","lightSeverity":"Low","lightSite":"https://drivesmartwarranty.com/2019/01/18/wiper/","lightImage":""},
    {"lightName":"Seatbelt Warning Light","lightDescription":"General Definition: Alerts that one or more seatbelts aren’t fastened.\n\nCommon Causes: Unfastened seatbelt or faulty seatbelt sensor.\n\nSuggested Actions: Ensure all passengers are wearing seatbelts. This is crucial for safety.","lightSeverity":"Medium","lightSite":"https://www.carparts.com/blog/seat-belt-warning-light-what-it-means-when-its-on/?srsltid=AfmBOoo-1proq10DPwXKqpjJ-sD1PRMZAuS3msoDsEJn6r6uFN37rRQD","lightImage":""},
    {"lightName":"Door Ajar Warning Light","lightDescription":"General Definition: Indicates that a door is open or not fully closed.\n\nCommon Causes: Door not fully latched or faulty door sensor.\n\nSuggested Actions: Check and close all doors securely before driving to prevent accidental opening.","lightSeverity":"Low","lightSite":"https://repairpal.com/door-ajar-warning-light#:~:text=Most%20cars%20today%20have%20a,be%20part%20of%20the%20system.","lightImage":""},
    {"lightName":"Low Fuel Warning Light","lightDescription":"General Definition: Alerts that fuel levels are low.\n\nCommon Causes: Low fuel levels.\n\nSuggested Actions: Plan to refuel soon to avoid running out. Running on low fuel can strain the fuel pump over time.","lightSeverity":"Medium","lightSite":"https://www.carparts.com/blog/fuel-low-what-does-the-low-fuel-light-mean/?srsltid=AfmBOoqnosZEqrS3SpJJUKa9A83plqzct5xEwdMGAx_XzGpG2B93uj_k","lightImage":""}
  ],
  "Status":"OK"
}
